Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: རྙོག་པའི་བསྐལ་པ་བར་མ་ནི་ཉེ་བར་གནས་པར་གྱུར་པའི་ཚེ། སེམས་ཅན་ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པས་བསྒྲིབས་པ།
en: During the intermediate kalpa of deterioration, beings were obscured by the obscurations of karma and kleśas, and they were engaged in fighting, quarreling, and disruption.

source: ཐབ་མོ་དང་རྩོད་པ་དང་དཀྲུགས་མ་ལ་ཞུགས་པར་གྱུར་པ་དང་། དགེ་སློང་སངས་རྒྱས་ཀྱི་བསྟན་པའི་ཡོན་ཏན་དོན་དུ་མི་གཉེར་ཅིང་ཡུལ་གྱི་དགའ་བ་ལྷུར་ལེན་པར་གྱུར་པ། རྒྱལ་པོ་དང་རྐུན་པོའི་གཏམ་ལ་ཞུགས་པ། བུད་མེད་དང་ཡུལ་དང་རྒྱ་མཚོའི་གཏམ་ལ་མོས་པ།
en: Bhikṣus were not concerned with the good qualities of the Buddha’s teachings but were dedicated to delighting in the objects of the senses, engaged in conversations about kings and thieves, were interested in stories about women and countries and oceans, and used the words of the Lokāyatas.

source: འཇིག་རྟེན་རྒྱང་ཕེན་པའི་ཚིག་ལ་ཞུགས་པ་རྣམས་ཡོངས་སུ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར།
en: “The follower of the Dharma cried out, ‘Oh!

source: ཀྱེ་མའོ་བསྐལ་པ་དུ་མར་ཡོངས་སུ་བསྒྲུབས་པའི་ཆོས་ཀྱི་སྒྲོན་མ་ཆེན་པོ་ནི་ནུབ་པར་གྱུར་མ་ཁད་དོ། །ཞེས་ཆོས་དང་ལྡན་པའི་འོ་དོད་བོས་ཏེ། ཡོངས་སུ་སྐྱོ་བར་འགྱུར་བའི་གཏམ་བྱས་ནས། དེ་སྟེང་གི་ནམ་མཁའི་དབྱིངས་སུ་ཏ་ལ་བདུན་ཙམ་དུ་མངོན་པར་འཕགས་ནས། འོད་འཕྲོ་བ་ཁ་དོག་མཐའ་ཡས་པའི་སྤྲིན་རབ་ཏུ་བཀྱེ་སྟེ།
en: The great lamp of the Dharma, which has been established for many kalpas, is close to being extinguished!’ Having said these sad words, he rose into the air to the height of seven palm trees and emanated clouds of light of infinite colors.

source: འོད་གཟེར་གྱི་དྲ་བའི་རྒྱན་ཆེན་པོ་ཁོ་དོག་སྣ་ཚོགས་དང་ལྡན་པ་བཀྱེ་ནས། འོད་ཁ་དོག་དུ་མ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་ཉོན་མོངས་པའི་གདུང་བ་ཞི་བར་བྱས་ཏེ། སེམས་ཅན་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་དེ་ཡང་ཕྱིར་གསལ་བར་བྱས་ཏེ། ལོ་སྟོང་ཕྲག་དྲུག་ཅུར་གནས་པར་གྱུར་ཏོ།
en: When he had emanated that great display of a net of light rays of various colors, those multicolored lights pacified the torment of the kleśas in the world and established beings without end or center in enlightenment, which revived the teachings of the tathāgata so that it remained for a further sixty thousand years.

source: །དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉི་མ་ལྟར་བཞིན་མདོག་དྲི་མ་མེད་པ། དེ་ཉིད་ཀྱི་བུ་མོ་དགེ་སློང་མ་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཅེས་བྱ་བ་དགེ་སློང་མ་བརྒྱ་ཕྲག་སྟོང་གི་འཁོར་དང་ལྡན་པ་བྱུང་སྟེ།
en: “At that time, the cakravartin king Vimala­vakrabhānu­prabha’s daughter, a bhikṣuṇī by the name of Dharma­cakra­nirmāṇa­prabhā, had an entourage of a hundred thousand bhikṣuṇīs.

source: དེས་ཡོངས་སུ་སྐྱོ་བར་འགྱུར་བའི་སྒྲ་དེ་ཐོས་ནས་ཆོ་འཕྲུལ་ཆེན་པོ་དེ་མཐོང་སྟེ། འཁོར་དང་བཅས་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། དགེ་སློང་མ་བརྒྱ་ཕྲག་སྟོང་པོ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་མངོན་དུ་འགྱུར་བ་ལ་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: When she heard those sad words and saw that miraculous manifestation, she and her entourage developed the aspiration for enlightenment, and the hundred thousand bhikṣuṇīs became irreversible on the path to the highest, complete enlightenment and attained the samādhi called the manifest presence of the tathāgatas

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཅེས་བྱ་བའི་གཟུངས་ཀྱང་རབ་ཏུ་ཐོབ་བོ།
en: They also obtained the power of mental retention called the light emanated from the Dharma wheel of all the tathāgatas

source: །ཆོས་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: They also attained the perfection of wisdom called the entry into all the ways of the ocean of the Dharma

source: །དགེ་སློང་མ་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསྟན་པ་ལས་བྱུང་བའི་འོད་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་ཟབ་མོ་ལ་འཇུག་པ་འདི་ཡང་ཤིན་ཏུ་ཕྲ་ཞིང་འཇམ་པའི་ཚུལ་དུ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: The bhikṣuṇī Dharma­cakra­nirmāṇa­prabhā attained the samādhi called the lamp of the light that arises from the teachings of all the tathāgatas , and she attained in a subtle and gentle way this bodhisattva liberation called the entry into beautiful sounds and profound manifestations

source: དེ་ཐོབ་པས་དེ་ལ་དེ་བཞིན་གཤེགས་པོ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་འོད་ཀྱི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མངོན་དུ་གྱུར་ཏོ།
en: When she had attained that, she directly perceived all the miraculous manifestations of the Tathāgata Sarva­dharma­sāgara­nirghoṣa­prabha­rāja.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: “Noble one, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉི་མ་ལྟར་བཞིན་མདོག་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་འོད་ཀྱི་རྒྱལ་པོའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བསྟན་པ་ནུབ་ཏུ་ཆ་བའི་ཚེ་དང་དུས་ན་བསྟན་པ་ཡོངས་སུ་འཛིན་ཅིང་ཆོས་ཀྱི་སྒྲོན་མ་ཆེན་པོ་འབར་བར་བྱེད་བྱེད་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who do you think was the cakravartin king Vimala­vakrabhānu­prabha, who entered homelessness in the teaching of the Tathāgata Sarva­dharma­sāgara­nirghoṣa­prabha­rāja and, after the turning of the wheel of the Dharma and the passing into nirvāṇa, when the teachings were coming to an end, lit the Dharma lamp of holding the teaching?

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Noble one, do not think that he was anyone else;

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉི་མ་ལྟར་བཞིན་མདོག་དྲི་མ་མེད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: at that time, in that time, the bodhisattva Samanta­bhadra was the cakravartin king Vimala­vakrabhānu­prabha.

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉི་མ་ལྟར་བཞིན་མདོག་དྲི་མ་མེད་པའི་བུ་མོ་དགེ་སློང་མ་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཅེས་བྱ་བ་དགེ་སློང་མ་བརྒྱ་ཕྲག་སྟོང་གི་འཁོར་དང་ལྡན་པ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who do you think was the bhikṣuṇī Dharma­cakra­nirmāṇa­prabhā, the daughter of the cakravartin king Vimala­vakrabhānu­prabha, who had an entourage of a hundred thousand bhikṣuṇīs? Noble one, do not think that she was anyone else;

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་མ་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: at that time, in that time, I was the bhikṣuṇī Dharma­cakra­nirmāṇa­prabhā.

source: དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དབྱངས་འོད་ཀྱི་རྒྱལ་པོའི་བསྟན་པ་ཡང་ཡོངས་སུ་བཟུང་ངོ་།
en: In that way, I held the teaching of the Tathāgata Sarva­dharma­sāgara­nirghoṣa­prabha­rāja.

source: །དགེ་སློང་མ་བརྒྱ་ཕྲག་སྟོང་པོ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་ཏེ།
en: I caused those hundred thousand bhikṣuṇīs to progress irreversibly toward the highest, complete enlightenment.

source: དེ་བཞིན་གཤེགས་པ་མངོན་དུ་འགྱུར་བ་ལ་ཡང་དག་པར་གཞོལ་བའི་ཏིང་ངེ་འཛིན་ལའང་རབ་ཏུ་བཀོད་དོ།
en: I established them in the samādhi called the manifest presence of the tathāgatas

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོས་སྤྲུལ་པའི་འོད་ཀྱི་གཟུངས་དང་། ཆོས་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ལ་འཇུག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལའང་རབ་ཏུ་བཀོད་དོ། །དེ་བཞིན་གཤེགས་པ་དེའི་འོག་ཏུ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆོས་དྲི་མ་མེད་པའི་རི་བོ་ཡེ་ཤེས་ཀྱི་རྩེ་མོའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: I also established them in the power of mental retention called the light emanated from the Dharma wheel of all tathāgatas and the perfection of wisdom called the entry into all the ways of the ocean of the Dharma

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་འོད་རབ་ཏུ་སྣང་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “After that tathāgata, I venerated the Tathāgata Vimala­dharma­parvata­jñāna­śikha­rābha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཉི་མ་དཔལ་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­maṇḍalāvabhāsa­prabha­cūḍa. After him, I venerated the Tathāgata Dharma­bhāskara­śrī­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་ཤིན་ཏུ་བསྟན་པའི་དབྱངས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­sāgara­nirdeśa­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharmāditya­jñāna­maṇḍala­pradīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མེ་ཏོག་དཔལ་གྱི་རྒྱལ་མཚན་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­kusuma­ketu­dhvaja­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འོད་འཕྲོ་རི་བོ་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharmārciḥ­parvata­ketu­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཚུལ་ཟབ་མོ་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­naya­gambhīra­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཡེ་ཤེས་ཡང་དག་པར་འབྱུང་བ་ཀུན་ཏུ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­jñāna­saṃbhava­samanta­pratibhāsa­garbha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Jñānākaracūḍa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིའི་དབང་པོ་དཔལ་གྱི་སྙིང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Śailendra­śrī­garbha­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྒོ་ཀུན་ནས་མཁྱེན་པའི་རི་བཟང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­mukha­jñāna­bhadra­meru.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་དྲག་པོའི་རྒྱལ་མཚན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Sarva­dharma­vīrya­vega­dhvaja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རིན་པོ་ཆེའི་མེ་ཏོག་དཔལ་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­ratna­kusuma­śrī­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་ཟབ་མོ་ཞི་བ་བརྩེགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Śānti­prabha­gambhīra­kūṭa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་གྱི་ཚུལ་རབ་ཏུ་སྣང་བའི་འོད་ཀྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Raśmi­netra­pratibhāsa­prabha­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འོད་འཕྲོ་བ་དཔལ་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Jñānārci­śrī­sāgara.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀུན་ཏུ་བཟང་པོའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­jñāna­bhadra­maṇḍala.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྦྱིའུ་ཚུགས་ཀྱི་ཕྱོགས་ཡེ་ཤེས་ཀྱིས་སྣང་བར་མཛད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Adhordhvadig­jñānāvabhāsa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་གྱི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Raśmi­saṃkusumita­pradīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སེང་གེའི་དཔལ་གྱི་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Jñāna­siṃha­ketu­dhvaja­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་ཉི་མ་ཀུན་ཏུ་སྣང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­sūryāvabhāsa­prabha­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པའི་རི་བོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Ratna­lakṣaṇa­vibhūṣita­meru.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཉི་མའི་རྣམ་པར་གནོན་པས་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Sūrya­vikrama­samanta­pratibhāsa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དྲ་བ་རྣམ་པར་སངས་རྒྱས་པའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­jāla­vibuddha­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་པདྨོ་རབ་ཏུ་རྒྱས་པའི་དཔལ་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­padma­praphullita­śrī­megha. After him, I venerated the Tathāgata Lakṣaṇa­sūrya­cakra­samanta­prabha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་ཉི་མའི་འཁོར་ལོ་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samantāvabhāsa­dharma­śrī­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མི་བསྙེངས་པའི་རྡོ་རྗེ་སེང་གེ་མཐུ་བོ་ཆེ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Vaiśāradya­vajra­nārāyaṇa­siṃha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རྒྱལ་མཚན་ཀུན་ཏུ་དཔལ་ཞེས་བྱ་བ་སྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­jñāna­dhvaja­śūra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཆོས་ཀྱི་པདྨོའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­padma­phulla­gātra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མེ་ཏོག་དཔལ་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Guṇa­kusuma­śrī­sāgara.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིག་རི་བོ་སྣང་བའི་ཕུང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­dhana­śikharābha­skandha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སྤོའི་འོད་འཕྲོ་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Jñāna­śikharārci­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྒོ་ཀུན་ནས་ཆོས་སྟོན་པའི་རི་བོའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­dharma­dvāra­vahana­śikha­rābha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྙིང་པོ་བྱང་ཆུབ་རྣམ་པར་སངས་རྒྱས་པའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Bodhi­maṇḍa­vibuddha­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་མ་རབ་ཏུ་འབར་བའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharmolkā­jvalana­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གཟུགས་བརྙན་ཀུན་ཏུ་སྣང་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­pratibhāsa­cūḍa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་གྱི་རྒྱལ་མཚན་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­megha­dhvaja­pradīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་ལྟར་བརྟན་པའི་རྒྱལ་མཚན་རྒྱ་མཚོའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Vajra­sāgara­dhvaja­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་རི་བོ་དཔལ་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Yaśaḥparvata­śrī­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཙན་དན་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Candana­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་མེ་ཏོག་ཀུན་ནས་རྒྱས་པའི་གཟི་བརྗིད་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­śrī­kusuma­tejābha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཏུ་སྣང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Sarva­sattvāvabhāsa­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་པདྨོ་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Guṇa­padma­śrī­garbha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་འོད་འཕྲོ་བ་རབ་ཏུ་སྣང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Gandhārciravabhāsa­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྒྱུ་པདྨོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Hetupadma.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་རི་བོ་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Lakṣaṇa­parvata­vairocana.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྙན་པ་ཀུན་ཏུ་རྣམ་པར་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­vighuṣṭa­kīrti­dhvaja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀུན་དུ་སྣང་བའི་རི་བོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­jñāna­prabhā­meru.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གྲོང་ཁྱེར་རབ་ཏུ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­nagara­prabha­śrī.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཤིང་གི་རི་བོ་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Druma­parvata­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དཔལ་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­śrī­vairocana­ketu.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོའི་ང་རོ་རབ་ཏུ་སྒྲོག་པའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­sāgara­nirnāda­nirghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་གནས་བསྒྲུབ་པ་ཡོངས་སུ་འགྲུབ་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Sarva­dharma­bhāvanārambha­saṃbhava­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀུན་ཏུ་སྣང་བའི་དམ་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­jñānābha­pravara.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་དམ་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Vara­lakṣaṇa­śrī.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྟོབས་ཀྱི་དཔའ་བའི་རྒྱལ་མཚན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­bala­śūla­dhvaja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་འོད་ཀྱི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­cakra­prabha­nirghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་ཡོན་ཏན་གྱི་ཅོད་པན་ཡེ་ཤེས་དང་ཤེས་རབ་ཀྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Raśmi­guṇa­makuṭa­jñāna­prajñā­prabha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་ཟླ་བས་འཕགས་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­cakra­candrodgata­śrī.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་པདྨོ་རྣམ་པར་སྣང་བས་རྣམ་པར་སངས་རྒྱས་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­padma­vairocana­vibuddha­ketu.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་པདྨོ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Ratna­padmāvabhāsa­garbha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་དཔལ་གྱི་རྩེ་མོའི་སྤྲིན་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Ratna­śrī­śikhara­megha­pradīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་མེ་ཏོག་ཀུན་ནས་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­sūci­suviśuddha­jñāna­kusuma.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་དཔལ་གྱི་རི་བོའི་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Nānā­raśmi­śrī­meru­garbha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་གྱི་དཀྱིལ་འཁོར་སྤོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Raśmi­maṇḍala­śikhara­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྣ་ཚོགས་ཀྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Puṇya­megha­cūḍa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་རི་བོ་རྒྱལ་མཚན་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­śikhara­dhvaja­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Guṇa­parvata­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ཉི་མའི་སྤྲིན་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­sūrya­megha­pradīpa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་སྙན་པ་རྣམ་པར་གྲགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­megha­vighuṣṭa­kīrti­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་ན་བུན་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­maṇḍala­paṭala­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་རྣམ་པར་སངས་རྒྱས་པའི་ཡེ་ཤེས་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Vibuddha­jñāna­bodhi­dhvaja­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་སངས་རྒྱས་པའི་དཔལ་གྱི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­maṇḍala­vibuddha­śrī­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གསེར་རིན་པོ་ཆེའི་རི་བོ་གཟི་བརྗིད་བཟང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Kanaka­maṇi­parvata­tejobhadra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་རི་བོ་གཟི་བརྗིད་བཟང་པོ་ཞེས་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Bhadra­śrī­meru­tejas.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་སྒྲ་ཀུན་ཏུ་འབྱུང་བའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­prajñapti­nirghoṣa­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྟོབས་ཀྱི་དཔལ་བརྩེགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­bala­śrī­kūṭa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྤོས་འོད་འཕྲོ་བའི་སྤྲིན་ཕུན་སུམ་ཚོགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Gandhārci­megha­śrī­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གསེར་རིན་པོ་ཆེའི་རིའི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Kanaka­maṇi­parvata­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གཙུག་ཏོར་གྱི་མཛོད་ཆོས་ཐམས་ཅད་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Uṣṇīṣa­kośa­sarva­dharma­prabhā­maṇḍala­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་འབར་བའི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­cakra­jvalana­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིའི་རྩེ་མོ་མངོན་པར་འཕགས་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Śaila­śikharābhyudgata­tejas.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་སྒྲོན་མ་ཀུན་ཏུ་སྣང་བའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samanta­vīryolkāvabhāsa­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་ཤིན་ཏུ་ཡངས་པའི་ཅོད་པན་ཤེས་རབ་ཀྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Samādhi­mudrā­vipula­makuṭa­prajñā­prabha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Ratna­rucira­śrī­rāja.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་མ་རིན་ཆེན་བླ་རེའི་དབྱངས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharmolkā­ratna­vitāna­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ནམ་མཁའ་ལ་སེང་གེའི་འོད་ཤིན་ཏུ་མཛེས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­gagana­kānta­siṃha­prabha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་གྱིས་རྣམ་པར་བརྒྱན་པའི་རྒྱལ་མཚན་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Lakṣaṇa­vibhūṣita­dhvaja­candra.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་གྱི་རི་བོ་རྣམ་པར་སྣང་བའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Raśmi­parvata­vidyotita­megha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ནམ་མཁའ་སྒྲིབ་པ་མེད་པའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Anāvaraṇa­dharma­gagana­prabha.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མཚན་ཡིད་དུ་འོང་བའི་མེ་ཏོག་གི་ཡན་ལག་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Lakṣaṇa­rucira­supuṣpitāṅga.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གྱི་དབང་པོ་དམ་པའི་འོད་ཀྱི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Lokendra­pravara­prabha­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་གྱི་འོད་ཀྱི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Sarva­dharma­samādhi­prabha­ghoṣa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒོའི་དབྱངས་མང་པོའི་མཛོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dvāra­svara­prabhūta­kośa.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་འབར་བའི་འོད་འཕྲོ་རྒྱ་མཚོའི་དབྱངས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: After him, I venerated the Tathāgata Dharma­jvalanārciḥ­sāgara­ghoṣa.
